---
kind: type
id: T:Autodesk.Revit.DB.NumberSystemJustifyOption
source: html/79101502-12b0-a9e3-06d1-5e5124e41261.htm
---
# Autodesk.Revit.DB.NumberSystemJustifyOption

The available options for justification of the numbers in a number system.

## Syntax (C#)
```csharp
public enum NumberSystemJustifyOption
```